// mock data
export const socials = [
  {
    name: 'vk',
    href: 'https://vk.com',
  },
  {
    name: 'insta',
    href: 'https://www.instagram.com',
  },
  {
    name: 'telegram',
    href: 'https://web.telegram.org',
  },
  {
    name: 'youtube',
    href: 'https://www.youtube.com',
  },
]

export const bullets = [
  { id: 1, href: 'promo' },
  { id: 2, href: 'professionals' },
  { id: 3, href: 'services' },
  { id: 4, href: 'how-we-work' },
  { id: 5, href: 'partners' },
  { id: 6, href: 'footer' },
]

export const navLinks = [
  {
    text: 'о нас',
    href: 'professionals'
  },
  {
    text: 'услуги',
    href: 'services'
  },
  {
    text: '6 шагов к вашему проекту',
    href: 'how-we-work'
  },
  {
    text: 'партнеры',
    href: 'partners'
  },
  {
    text: 'контакты',
    href: 'footer'
  },
]

export const servicesCards = [
  {
    id: 1,
    path: 'production',
    title: 'Собственное производство электрощитового оборудования',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.'
  },
  {
    id: 2,
    path: 'сonstruction',
    title: 'Строительство и проектирование кабельных систем',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.'
  },
  {
    id: 3,
    path: 'laboratory',
    title: 'Электролаборатория',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.'
  },
  {
    id: 4,
    path: 'engineering',
    title: 'Обслуживание инжинерных систем',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.'
  },
  {
    id: 5,
    path: 'mounting',
    title: 'Проектирование и монтаж электросетей',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.'
  },
]

export const workSlides = [
  {
    id: 1,
    title: 'оставляете заявку',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'
  },
  {
    id: 2,
    title: 'выезд специалиста на объект',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'
  },
  {
    id: 3,
    title: 'составление сметы',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'
  },
  {
    id: 4,
    title: 'подписание договора',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'
  },
  {
    id: 5,
    title: 'начало работ',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'
  },
  {
    id: 6,
    title: 'завершение',
    text: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'
  },
]

export const partnersSlides = [
  { name: 'rzd' },
  { name: 'arguments' },
  { name: 'okey' },
  { name: 'sber1' },
  { name: 'uralsib' },
  { name: 'sber2' },
]

export const productionList = [
  {
    title: 'Собственное производство электрощитового оборудования',
    price: '1000',
    services: [
      {
        id: 1,
        text: 'Разработка индивидуального дизайн проекта'
      },
      {
        id: 2,
        text: 'Сопровождение инженера и дизайнера на протяжение всего ремонта'
      },
      {
        id: 3,
        text: 'Помощь в подборе мебели, техники, сантехники, чистовых отделочных материалов'
      },
      {
        id: 4,
        text: 'Организация закупки материалов'
      },
      {
        id: 5,
        text: 'Демонтаж и возведение межкомнатных перегородок'
      },
      {
        id: 6,
        text: 'Выравнивание стен под маяк, финишная отделка стен под обои'
      },
      {
        id: 7,
        text: 'Выведение углов 90 градусов'
      },
      {
        id: 8,
        text: 'Электромонтажные работы (согласно проекта)'
      },
      {
        id: 9,
        text: 'Монтаж слаботочной проводки (интернет, антенна)'
      },
      {
        id: 10,
        text: 'Видеодомофон, камеры видеонаблюдения'
      },
      {
        id: 11,
        text: 'Монтаж водопровода и канализации (трубы Rehau, материалы класса EXTRA)'
      },
      {
        id: 12,
        text: 'Гидроизоляция мокрых зон'
      },
      {
        id: 13,
        text: 'Заливка стяжки пола'
      },
      {
        id: 14,
        text: 'Финишная отделка стен'
      },
      {
        id: 15,
        text: 'Покраска стен, декоративная штукатурка'
      },
      {
        id: 16,
        text: 'Финишная отделка пола'
      },
      {
        id: 17,
        text: 'Укладка ламината, укладка паркетной и массивной доски с использованием двухкомпонентного клея'
      },
      {
        id: 18,
        text: 'Укладка плитки с подрезкой под 45 градусов, укладка мозаики'
      },
      {
        id: 19,
        text: 'Монтаж напольного плинтуса'
      },
      {
        id: 20,
        text: 'Монтаж потолочного плинтуса'
      },
      {
        id: 21,
        text: 'Потолок натяжной EXTRA качества ("парящая" конструкция)'
      },
      {
        id: 22,
        text: 'Монтаж Потолка ГКЛ любой конфигурации, с подготовкой и покраской'
      },
      {
        id: 23,
        text: 'Установка межкомнатных дверей'
      },
      {
        id: 24,
        text: 'Установка ванны с облицовкой ванны в плитку, монтаж душевой кабины'
      },
      {
        id: 25,
        text: 'Монтаж унитаза, дополнительный унитаз, установка биде'
      },
      {
        id: 26,
        text: 'Монтаж раковины любой конфигурации'
      },
      {
        id: 27,
        text: 'Монтаж смесителей'
      },
      {
        id: 28,
        text: 'Монтаж скрытого лючка ревизии с облицовкой в плитку'
      },
      {
        id: 29,
        text: 'Замена труб отопления, перенос отопительных приборов'
      },
      {
        id: 30,
        text: 'Монтаж системы контроля протечек воды'
      },
      {
        id: 31,
        text: 'Монтаж проточного или накопительного водонагревателя'
      },
      {
        id: 32,
        text: 'Монтаж электрофурнитуры'
      },
      {
        id: 33,
        text: 'Монтаж осветительных приборов'
      },
      {
        id: 34,
        text: 'Монтаж потолочного карниза'
      },
      {
        id: 35,
        text: 'Вентиляционные работы'
      },
      {
        id: 36,
        text: 'Звукоизоляционные работы'
      },
      {
        id: 37,
        text: 'Теплоизоляционные работы'
      },
      {
        id: 38,
        text: 'Монтаж системы кондиционирования'
      },
      {
        id: 39,
        text: 'Проходные выключатели'
      },
      {
        id: 40,
        text: 'Полный, профессиональный клининг после ремонта'
      },
      {
        id: 41,
        text: 'Фото и видео отчеты о ходе работ'
      }
    ]
  }
]

export const сonstructionList = [
  {
    title: 'Строительство и проектирование кабельных систем',
    price: '2000',
    services: [
      {
        id: 1,
        text: 'Разработка индивидуального дизайн проекта'
      },
      {
        id: 2,
        text: 'Сопровождение инженера и дизайнера на протяжение всего ремонта'
      },
      {
        id: 3,
        text: 'Помощь в подборе мебели, техники, сантехники, чистовых отделочных материалов'
      },
      {
        id: 4,
        text: 'Организация закупки материалов'
      },
      {
        id: 5,
        text: 'Демонтаж и возведение межкомнатных перегородок'
      },
      {
        id: 6,
        text: 'Выравнивание стен под маяк, финишная отделка стен под обои'
      },
      {
        id: 7,
        text: 'Выведение углов 90 градусов'
      },
      {
        id: 8,
        text: 'Электромонтажные работы (согласно проекта)'
      },
      {
        id: 9,
        text: 'Монтаж слаботочной проводки (интернет, антенна)'
      },
      {
        id: 10,
        text: 'Видеодомофон, камеры видеонаблюдения'
      },
      {
        id: 11,
        text: 'Монтаж водопровода и канализации (трубы Rehau, материалы класса EXTRA)'
      },
      {
        id: 12,
        text: 'Гидроизоляция мокрых зон'
      },
      {
        id: 13,
        text: 'Заливка стяжки пола'
      },
      {
        id: 14,
        text: 'Финишная отделка стен'
      },
      {
        id: 15,
        text: 'Покраска стен, декоративная штукатурка'
      },
      {
        id: 16,
        text: 'Финишная отделка пола'
      },
      {
        id: 17,
        text: 'Укладка ламината, укладка паркетной и массивной доски с использованием двухкомпонентного клея'
      },
      {
        id: 18,
        text: 'Укладка плитки с подрезкой под 45 градусов, укладка мозаики'
      },
      {
        id: 19,
        text: 'Монтаж напольного плинтуса'
      },
      {
        id: 20,
        text: 'Монтаж потолочного плинтуса'
      },
      {
        id: 21,
        text: 'Потолок натяжной EXTRA качества ("парящая" конструкция)'
      },
      {
        id: 22,
        text: 'Монтаж Потолка ГКЛ любой конфигурации, с подготовкой и покраской'
      },
      {
        id: 23,
        text: 'Установка межкомнатных дверей'
      },
      {
        id: 24,
        text: 'Установка ванны с облицовкой ванны в плитку, монтаж душевой кабины'
      },
      {
        id: 25,
        text: 'Монтаж унитаза, дополнительный унитаз, установка биде'
      },
      {
        id: 26,
        text: 'Монтаж раковины любой конфигурации'
      },
      {
        id: 27,
        text: 'Монтаж смесителей'
      },
      {
        id: 28,
        text: 'Монтаж скрытого лючка ревизии с облицовкой в плитку'
      },
      {
        id: 29,
        text: 'Замена труб отопления, перенос отопительных приборов'
      },
      {
        id: 30,
        text: 'Монтаж системы контроля протечек воды'
      },
      {
        id: 31,
        text: 'Монтаж проточного или накопительного водонагревателя'
      },
      {
        id: 32,
        text: 'Монтаж электрофурнитуры'
      },
      {
        id: 33,
        text: 'Монтаж осветительных приборов'
      },
      {
        id: 34,
        text: 'Монтаж потолочного карниза'
      },
      {
        id: 35,
        text: 'Вентиляционные работы'
      },
      {
        id: 36,
        text: 'Звукоизоляционные работы'
      },
      {
        id: 37,
        text: 'Теплоизоляционные работы'
      },
      {
        id: 38,
        text: 'Монтаж системы кондиционирования'
      },
      {
        id: 39,
        text: 'Проходные выключатели'
      },
      {
        id: 40,
        text: 'Полный, профессиональный клининг после ремонта'
      },
      {
        id: 41,
        text: 'Фото и видео отчеты о ходе работ'
      }
    ]
  }
]

export const laboratoryList = [
  {
    title: 'Электролаборатория',
    price: '3000',
    services: [
      {
        id: 1,
        text: 'Разработка индивидуального дизайн проекта'
      },
      {
        id: 2,
        text: 'Сопровождение инженера и дизайнера на протяжение всего ремонта'
      },
      {
        id: 3,
        text: 'Помощь в подборе мебели, техники, сантехники, чистовых отделочных материалов'
      },
      {
        id: 4,
        text: 'Организация закупки материалов'
      },
      {
        id: 5,
        text: 'Демонтаж и возведение межкомнатных перегородок'
      },
      {
        id: 6,
        text: 'Выравнивание стен под маяк, финишная отделка стен под обои'
      },
      {
        id: 7,
        text: 'Выведение углов 90 градусов'
      },
      {
        id: 8,
        text: 'Электромонтажные работы (согласно проекта)'
      },
      {
        id: 9,
        text: 'Монтаж слаботочной проводки (интернет, антенна)'
      },
      {
        id: 10,
        text: 'Видеодомофон, камеры видеонаблюдения'
      },
      {
        id: 11,
        text: 'Монтаж водопровода и канализации (трубы Rehau, материалы класса EXTRA)'
      },
      {
        id: 12,
        text: 'Гидроизоляция мокрых зон'
      },
      {
        id: 13,
        text: 'Заливка стяжки пола'
      },
      {
        id: 14,
        text: 'Финишная отделка стен'
      },
      {
        id: 15,
        text: 'Покраска стен, декоративная штукатурка'
      },
      {
        id: 16,
        text: 'Финишная отделка пола'
      },
      {
        id: 17,
        text: 'Укладка ламината, укладка паркетной и массивной доски с использованием двухкомпонентного клея'
      },
      {
        id: 18,
        text: 'Укладка плитки с подрезкой под 45 градусов, укладка мозаики'
      },
      {
        id: 19,
        text: 'Монтаж напольного плинтуса'
      },
      {
        id: 20,
        text: 'Монтаж потолочного плинтуса'
      },
      {
        id: 21,
        text: 'Потолок натяжной EXTRA качества ("парящая" конструкция)'
      },
      {
        id: 22,
        text: 'Монтаж Потолка ГКЛ любой конфигурации, с подготовкой и покраской'
      },
      {
        id: 23,
        text: 'Установка межкомнатных дверей'
      },
      {
        id: 24,
        text: 'Установка ванны с облицовкой ванны в плитку, монтаж душевой кабины'
      },
      {
        id: 25,
        text: 'Монтаж унитаза, дополнительный унитаз, установка биде'
      },
      {
        id: 26,
        text: 'Монтаж раковины любой конфигурации'
      },
      {
        id: 27,
        text: 'Монтаж смесителей'
      },
      {
        id: 28,
        text: 'Монтаж скрытого лючка ревизии с облицовкой в плитку'
      },
      {
        id: 29,
        text: 'Замена труб отопления, перенос отопительных приборов'
      },
      {
        id: 30,
        text: 'Монтаж системы контроля протечек воды'
      },
      {
        id: 31,
        text: 'Монтаж проточного или накопительного водонагревателя'
      },
      {
        id: 32,
        text: 'Монтаж электрофурнитуры'
      },
      {
        id: 33,
        text: 'Монтаж осветительных приборов'
      },
      {
        id: 34,
        text: 'Монтаж потолочного карниза'
      },
      {
        id: 35,
        text: 'Вентиляционные работы'
      },
      {
        id: 36,
        text: 'Звукоизоляционные работы'
      },
      {
        id: 37,
        text: 'Теплоизоляционные работы'
      },
      {
        id: 38,
        text: 'Монтаж системы кондиционирования'
      },
      {
        id: 39,
        text: 'Проходные выключатели'
      },
      {
        id: 40,
        text: 'Полный, профессиональный клининг после ремонта'
      },
      {
        id: 41,
        text: 'Фото и видео отчеты о ходе работ'
      }
    ]
  }
]

export const engineeringList = [
  {
    title: 'Обслуживание инжинерных систем',
    price: '4000',
    services: [
      {
        id: 1,
        text: 'Разработка индивидуального дизайн проекта'
      },
      {
        id: 2,
        text: 'Сопровождение инженера и дизайнера на протяжение всего ремонта'
      },
      {
        id: 3,
        text: 'Помощь в подборе мебели, техники, сантехники, чистовых отделочных материалов'
      },
      {
        id: 4,
        text: 'Организация закупки материалов'
      },
      {
        id: 5,
        text: 'Демонтаж и возведение межкомнатных перегородок'
      },
      {
        id: 6,
        text: 'Выравнивание стен под маяк, финишная отделка стен под обои'
      },
      {
        id: 7,
        text: 'Выведение углов 90 градусов'
      },
      {
        id: 8,
        text: 'Электромонтажные работы (согласно проекта)'
      },
      {
        id: 9,
        text: 'Монтаж слаботочной проводки (интернет, антенна)'
      },
      {
        id: 10,
        text: 'Видеодомофон, камеры видеонаблюдения'
      },
      {
        id: 11,
        text: 'Монтаж водопровода и канализации (трубы Rehau, материалы класса EXTRA)'
      },
      {
        id: 12,
        text: 'Гидроизоляция мокрых зон'
      },
      {
        id: 13,
        text: 'Заливка стяжки пола'
      },
      {
        id: 14,
        text: 'Финишная отделка стен'
      },
      {
        id: 15,
        text: 'Покраска стен, декоративная штукатурка'
      },
      {
        id: 16,
        text: 'Финишная отделка пола'
      },
      {
        id: 17,
        text: 'Укладка ламината, укладка паркетной и массивной доски с использованием двухкомпонентного клея'
      },
      {
        id: 18,
        text: 'Укладка плитки с подрезкой под 45 градусов, укладка мозаики'
      },
      {
        id: 19,
        text: 'Монтаж напольного плинтуса'
      },
      {
        id: 20,
        text: 'Монтаж потолочного плинтуса'
      },
      {
        id: 21,
        text: 'Потолок натяжной EXTRA качества ("парящая" конструкция)'
      },
      {
        id: 22,
        text: 'Монтаж Потолка ГКЛ любой конфигурации, с подготовкой и покраской'
      },
      {
        id: 23,
        text: 'Установка межкомнатных дверей'
      },
      {
        id: 24,
        text: 'Установка ванны с облицовкой ванны в плитку, монтаж душевой кабины'
      },
      {
        id: 25,
        text: 'Монтаж унитаза, дополнительный унитаз, установка биде'
      },
      {
        id: 26,
        text: 'Монтаж раковины любой конфигурации'
      },
      {
        id: 27,
        text: 'Монтаж смесителей'
      },
      {
        id: 28,
        text: 'Монтаж скрытого лючка ревизии с облицовкой в плитку'
      },
      {
        id: 29,
        text: 'Замена труб отопления, перенос отопительных приборов'
      },
      {
        id: 30,
        text: 'Монтаж системы контроля протечек воды'
      },
      {
        id: 31,
        text: 'Монтаж проточного или накопительного водонагревателя'
      },
      {
        id: 32,
        text: 'Монтаж электрофурнитуры'
      },
      {
        id: 33,
        text: 'Монтаж осветительных приборов'
      },
      {
        id: 34,
        text: 'Монтаж потолочного карниза'
      },
      {
        id: 35,
        text: 'Вентиляционные работы'
      },
      {
        id: 36,
        text: 'Звукоизоляционные работы'
      },
      {
        id: 37,
        text: 'Теплоизоляционные работы'
      },
      {
        id: 38,
        text: 'Монтаж системы кондиционирования'
      },
      {
        id: 39,
        text: 'Проходные выключатели'
      },
      {
        id: 40,
        text: 'Полный, профессиональный клининг после ремонта'
      },
      {
        id: 41,
        text: 'Фото и видео отчеты о ходе работ'
      }
    ]
  }
]

export const mountingList = [
  {
    title: 'Проектирование и монтаж электросетей',
    price: '5000',
    services: [
      {
        id: 1,
        text: 'Разработка индивидуального дизайн проекта'
      },
      {
        id: 2,
        text: 'Сопровождение инженера и дизайнера на протяжение всего ремонта'
      },
      {
        id: 3,
        text: 'Помощь в подборе мебели, техники, сантехники, чистовых отделочных материалов'
      },
      {
        id: 4,
        text: 'Организация закупки материалов'
      },
      {
        id: 5,
        text: 'Демонтаж и возведение межкомнатных перегородок'
      },
      {
        id: 6,
        text: 'Выравнивание стен под маяк, финишная отделка стен под обои'
      },
      {
        id: 7,
        text: 'Выведение углов 90 градусов'
      },
      {
        id: 8,
        text: 'Электромонтажные работы (согласно проекта)'
      },
      {
        id: 9,
        text: 'Монтаж слаботочной проводки (интернет, антенна)'
      },
      {
        id: 10,
        text: 'Видеодомофон, камеры видеонаблюдения'
      },
      {
        id: 11,
        text: 'Монтаж водопровода и канализации (трубы Rehau, материалы класса EXTRA)'
      },
      {
        id: 12,
        text: 'Гидроизоляция мокрых зон'
      },
      {
        id: 13,
        text: 'Заливка стяжки пола'
      },
      {
        id: 14,
        text: 'Финишная отделка стен'
      },
      {
        id: 15,
        text: 'Покраска стен, декоративная штукатурка'
      },
      {
        id: 16,
        text: 'Финишная отделка пола'
      },
      {
        id: 17,
        text: 'Укладка ламината, укладка паркетной и массивной доски с использованием двухкомпонентного клея'
      },
      {
        id: 18,
        text: 'Укладка плитки с подрезкой под 45 градусов, укладка мозаики'
      },
      {
        id: 19,
        text: 'Монтаж напольного плинтуса'
      },
      {
        id: 20,
        text: 'Монтаж потолочного плинтуса'
      },
      {
        id: 21,
        text: 'Потолок натяжной EXTRA качества ("парящая" конструкция)'
      },
      {
        id: 22,
        text: 'Монтаж Потолка ГКЛ любой конфигурации, с подготовкой и покраской'
      },
      {
        id: 23,
        text: 'Установка межкомнатных дверей'
      },
      {
        id: 24,
        text: 'Установка ванны с облицовкой ванны в плитку, монтаж душевой кабины'
      },
      {
        id: 25,
        text: 'Монтаж унитаза, дополнительный унитаз, установка биде'
      },
      {
        id: 26,
        text: 'Монтаж раковины любой конфигурации'
      },
      {
        id: 27,
        text: 'Монтаж смесителей'
      },
      {
        id: 28,
        text: 'Монтаж скрытого лючка ревизии с облицовкой в плитку'
      },
      {
        id: 29,
        text: 'Замена труб отопления, перенос отопительных приборов'
      },
      {
        id: 30,
        text: 'Монтаж системы контроля протечек воды'
      },
      {
        id: 31,
        text: 'Монтаж проточного или накопительного водонагревателя'
      },
      {
        id: 32,
        text: 'Монтаж электрофурнитуры'
      },
      {
        id: 33,
        text: 'Монтаж осветительных приборов'
      },
      {
        id: 34,
        text: 'Монтаж потолочного карниза'
      },
      {
        id: 35,
        text: 'Вентиляционные работы'
      },
      {
        id: 36,
        text: 'Звукоизоляционные работы'
      },
      {
        id: 37,
        text: 'Теплоизоляционные работы'
      },
      {
        id: 38,
        text: 'Монтаж системы кондиционирования'
      },
      {
        id: 39,
        text: 'Проходные выключатели'
      },
      {
        id: 40,
        text: 'Полный, профессиональный клининг после ремонта'
      },
      {
        id: 41,
        text: 'Фото и видео отчеты о ходе работ'
      }
    ]
  }
]

// animations
export const sloganVariants = {
  hidden: {
    x: -200,
    opacity: 0,
  },
  visible: {
    x: 0,
    opacity: 1,
    transition: {
      duration: 0.3,
      delay: 0.2
    }
  }
}

export const servicesCardVariants = {
  hidden: {
    opacity: 0,
  },
  visible: {
    opacity: 1,
    transition: {
      delay: 0.3,
      duration: 0.3
    }
  },
  closed: {
    opacity: 0,
    transition: {
      delay: 0,
      duration: 0
    }
  }
}

export const headerVariants = {
  hidden: {
    y: -200,
  },
  visible: {
    y: 0,
    transition: {
      duration: 0.3
    }
  },
  closed: {
    y: -200,
    transition: {
      duration: 0.3
    }
  }
}

export const leftPanelVariants = {
  hidden: {
    x: -100,
  },
  visible: {
    x: 0,
    transition: {
      duration: 0.3
    }
  },
  closed: {
    x: -100,
    transition: {
      duration: 0.3
    }
  }
}

export const professionalsTitleVariants = {
  hidden: {
    y: -80,
    opacity: 0,
  },
  visible: custom => ({
    y: 0,
    opacity: 1,
    transition: {
      duration: 0.3,
      delay: custom * 0.2
    }
  })
}

export const professionalsTextVariants = {
  hidden: {
    y: 80,
    opacity: 0,
  },
  visible: custom => ({
    y: 0,
    opacity: 1,
    transition: {
      duration: 0.3,
      delay: custom * 0.2
    }
  })
}

// constants
export const COLOR_WHITE = { color: '#FFFFFF' }

export const EMAILJS_SERVICE_ID = 'service_j2akzgt'

export const EMAILJS_TEMPLATE_ID = 'template_stpxspy'

export const EMAILJS_PUBLIC_KEY = '5mBhizRVj0aYujetT'
